; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v10 ?v3)
             (pred_12 ?v2 ?v11)
             (pred_1 ?v10 ?v11)
             (pred_4 ?v5 ?v10 )
	     (pred_9 ?v10)
             (pred_6 ?v7)
             (pred_10 ?v2)
             (pred_8 ?v11)
             (pred_11 ?v10)
             (pred_5 ?v2)
             (pred_3 ?v10)
             (pred_7 ))



(:action op_4
:parameters (?v4 ?v8 ?v6 ?v12)
:precondition (and (pred_6 ?v4) (pred_6 ?v8) (pred_10 ?v6) (pred_8 ?v12)
          (pred_2 ?v4 ?v8) (pred_12 ?v6 ?v12)
                   (pred_1 ?v8 ?v12) (pred_9 ?v4) 
                   (pred_11 ?v8) (pred_5 ?v6))
:effect (and  (pred_3 ?v8) (not (pred_11 ?v8))))


(:action op_3
:parameters (?v4 ?v1)
:precondition (and (pred_6 ?v4) (pred_6 ?v1)
               (pred_9 ?v4) (pred_2 ?v4 ?v1) (pred_3 ?v1))
:effect (and (pred_9 ?v1) (not (pred_9 ?v4))))

(:action op_1
:parameters (?v4 ?v6)
:precondition (and (pred_6 ?v4) (pred_10 ?v6) 
                  (pred_9 ?v4) (pred_4 ?v6 ?v4) (pred_7 ))
:effect (and (pred_5 ?v6)
   (not (pred_4 ?v6 ?v4)) (not (pred_7 ))))


(:action op_5
:parameters (?v4 ?v9 ?v13)
:precondition (and (pred_6 ?v4) (pred_10 ?v9) (pred_10 ?v13)
                  (pred_9 ?v4) (pred_5 ?v13) (pred_4 ?v9 ?v4))
:effect (and (pred_5 ?v9) (pred_4 ?v13 ?v4)
        (not (pred_5 ?v13)) (not (pred_4 ?v9 ?v4))))

(:action op_2
:parameters (?v4 ?v6)
:precondition (and (pred_6 ?v4) (pred_10 ?v6) 
                  (pred_9 ?v4) (pred_5 ?v6))
:effect (and (pred_7 ) (pred_4 ?v6 ?v4) (not (pred_5 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_19 obj_21 obj_11 obj_10 obj_02 obj_08 obj_03 obj_14 obj_17 obj_07 obj_04 obj_12 obj_18 obj_13 obj_05
    obj_06 obj_16
    obj_15 obj_20 obj_09
    )

    (:init
       (pred_7)

       (pred_6 obj_01)
       (pred_6 obj_19)
       (pred_6 obj_21)
       (pred_6 obj_11)
       (pred_6 obj_10)
       (pred_6 obj_02)
       (pred_6 obj_08)
       (pred_6 obj_03)
       (pred_6 obj_14)
       (pred_6 obj_17)
       (pred_6 obj_07)
       (pred_6 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_18)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_8 obj_06)
       (pred_8 obj_16)
       (pred_10 obj_15)
       (pred_10 obj_20)
       (pred_10 obj_09)

       (pred_2 obj_01 obj_10)
       (pred_2 obj_01 obj_19)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_19 obj_21)
       (pred_2 obj_19 obj_01)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_21 obj_19)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_10 obj_14)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_02 obj_08)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_08 obj_03)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_08 obj_02)
       (pred_2 obj_03 obj_04)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_03 obj_08)
       (pred_2 obj_14 obj_12)
       (pred_2 obj_14 obj_17)
       (pred_2 obj_14 obj_10)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_07)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_17 obj_14)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_04)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_17)
       (pred_2 obj_04 obj_05)
       (pred_2 obj_04 obj_03)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_12 obj_14)
       (pred_2 obj_18 obj_13)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_13 obj_18)
       (pred_2 obj_05 obj_04)
       (pred_2 obj_05 obj_13)
       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_12)
       (pred_1  obj_21 obj_06)
       (pred_1  obj_18 obj_16)
       (pred_1  obj_12 obj_16)
       (pred_3 obj_01)
       (pred_3 obj_19)
       (pred_3 obj_11)
       (pred_3 obj_10)
       (pred_3 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_03)
       (pred_3 obj_14)
       (pred_3 obj_17)
       (pred_3 obj_07)
       (pred_3 obj_04)
       (pred_3 obj_13)
       (pred_3 obj_05)

       (pred_12  obj_15 obj_06)
       (pred_12  obj_20 obj_16)
       (pred_12  obj_09 obj_06)
       (pred_4 obj_15 obj_07)
       (pred_4 obj_20 obj_02)
       (pred_4 obj_09 obj_02)
       (pred_9 obj_19)
    )

    (:goal (and
       (pred_4 obj_15 obj_21)
    ))
(:constraints
  (always (not (pred_9 obj_08)))
)
)

; plan
1. (op_3 obj_19 obj_02)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_02)
   goals met: 0 of 1
2. (op_1 obj_02 obj_09)
   deleted: (pred_4 obj_09 obj_02) (pred_7)
   added: (pred_5 obj_09)
   goals met: 0 of 1
3. (op_3 obj_02 obj_17)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_17)
   goals met: 0 of 1
4. (op_3 obj_17 obj_07)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_07)
   goals met: 0 of 1
5. (op_5 obj_07 obj_15 obj_09)
   deleted: (pred_5 obj_09) (pred_4 obj_15 obj_07)
   added: (pred_5 obj_15) (pred_4 obj_09 obj_07)
   goals met: 0 of 1
6. (op_3 obj_07 obj_17)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_17)
   goals met: 0 of 1
7. (op_3 obj_17 obj_02)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_02)
   goals met: 0 of 1
8. (op_3 obj_02 obj_19)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_19)
   goals met: 0 of 1
9. (op_4 obj_19 obj_21 obj_15 obj_06)
   deleted: (pred_11 obj_21)
   added: (pred_3 obj_21)
   goals met: 0 of 1
10. (op_3 obj_19 obj_21)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_21)
   goals met: 0 of 1
11. (op_2 obj_21 obj_15)
   deleted: (pred_5 obj_15)
   added: (pred_7) (pred_4 obj_15 obj_21)
   goals met: 1 of 1
